mtosi1.1-TestSuite/TestsDefinitions/ManagedElementMgr/examples/ManagedElementMgr_getContainingTPs.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/ManagedElementMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header>
		<header tmf854Version="1.1">
			<activityName>getContainingTPs</activityName>
			<msgName>getContainingTPs</msgName>
			<msgType>REQUEST</msgType>
			<correlationId>0001</correlationId>
			<senderURI>/MTOSI/InventoryOS</senderURI>
			<destinationURI>/MTOSI/EMS01</destinationURI>
			<communicationPattern>SimpleResponse</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<getContainingTPs tmf854Version="1.1">
			<tpName>
				<mdNm>Networks/XdrEMS/Server1</mdNm>
				<meNm>768</meNm>
				<ptpNm>/shelf=1/slot=12/port=1</ptpNm>
				<ctpNm>/sts12c_vc4_4c-j=2</ctpNm>
			</tpName>
		</getContainingTPs>
	</soap:Body>
</soap:Envelope>
